MAC  48位     6字节     前24位厂商标示    后24位产品唯一编号  
MTU  最大传输单元   1500
学习  广播  转发  更新  超300秒，链路down
vlan  广播控制   增加安全  提高带宽利用   降低数据延迟
trunk   打标记
以太通道  增加带宽，提高可靠 


192.168.1.1/24
网络位  主机位
255.255.255.0

网络ID
192.168.1.0
广播地址
192.168.1.255

192.168.1.2/24

A 1～127
255.0.0.0
B 128～191
255.255.0.0
C 192～223
255.255.255.0

192.168.1.1/16

192.168.10.1/16

172.16.0.1
172.16.0.0

172.16.10.1
172.16.0.0

Router(config)#interface gigabitEthernet 0/0    //进入千兆接口
Router(config-if)#ip address 192.168.1.254 255.255.255.0  	//配置ip地址
Router(config-if)#no shutdown 	//开启接口
Router#show ip route      //查看路由表
C  直连路由，接口配置好ip，并开启后自动生成
S  静态路由  ip route 
S* 默认路由  ip route 0.0.0.0 0.0.0.0 下一跳
      动态路由
	只允许配置对外方向，否则容易出现路由环路

路由器1配置的静态路由
Router(config)#ip route 192.168.3.0 255.255.255.0 192.168.2.2  
路由器2配置的静态路由
Router(config)#ip route 192.168.1.0 255.255.255.0 192.168.2.1

静态路由如果配置错误要及时删除
Router(config)#no ip route 192.168.1.0 255.255.255.0 192.168.2.1

配置思路：
1，检查路由表 （show ip route），找到无法到达的网段
2，使用静态路由，添加网段

三层交换机=二层转发+三层路由

在三层交换机启用路由功能
Switch(config)# ip routing

配置虚接口的IP
Switch(config)# interface vlan 1
Switch(config-if)# ip address 192.168.1.254 255.255.255.0
Switch(config-if)# no shutdown

在三层交换机上配置Trunk前要先指定接口封装为802.1q
Switch(config)#interface fastEthernet 0/24
Switch(config-if)#switchport trunk encapsulation dot1q 
Switch(config-if)#switchport mode trunk 

排错思路：
1，检查ip地址与网关
2，检查接口是否加入相应的vlan
3，网关设备（三层交换）的vlan虚接口ip是否配置正确并开启
4，交换机与交换机之间的链路是否配置为trunk
5，三层交换的路由功能是否开启

show ip interface brief			//查看接口摘要信息，是否配置ip，是否开启
三层交换机配置默认路由前往外网：
Switch(config)#ip route 0.0.0.0 0.0.0.0 192.168.4.2	





